%завдання 6
format long
a=5.3
b=10.6
c=876
%Квадратне рівняння вирішимо за дискримінантом
x1= ((-b)+(sqrt((b^2)-(4*a*c))))/2*a
x2=((-b)-(sqrt((b^2)-(4*a*c))))/2*a
% Перевірка
x3=(a*(x1^2))+(b*x1)+c
x4=(a*(x2^2))+(b*x2)+c
fprintf ('Рівняння %gx^2+%gx+%g=0 \n Корені x1=%g%fi, \nx2=%g %fi',a,b,c,x1,x2,imag(x1),imag(x2))

%Завдання №7
z1=1+i*(pi/2)
z2=1.2*exp(107)
z3=0.8-2i
z4=2.5*exp(14*i)
% завдання 3
z5=(((z1/z2)+z3)^3)*z4
% завдання 4
format long
x=9
exp(i*x)
cos(x)+i*sin(x)